Output from `terraform plan`
```
  + resource "aws_iam_policy" "step_function_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-replay-pipeline-nomis-prisoner-profile-preproduction-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:UpdateLogDelivery",
                          + "logs:PutResourcePolicy",
                          + "logs:ListLogDeliveries",
                          + "logs:GetLogDelivery",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                          + "logs:DeleteLogDelivery",
                          + "logs:CreateLogDelivery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.replay-pipeline["prisoner-profile"].module.replay_pipeline.aws_iam_role.step_function_role[0] will be created
  + resource "aws_iam_role" "step_function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-replay-pipeline-nomis-prisoner-profile-preproduction-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.replay-pipeline["prisoner-profile"].module.replay_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"
      + role       = (known after apply)
    }

  # module.replay-pipeline["prisoner-profile"].module.replay_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.replay-pipeline["prisoner-profile"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Replay Pipeline Step Function"
              + StartAt = "Stop Glue Streaming Job"
              + States  = {
                  + "Copy Data to Temp-Reload Bucket"                      = {
                      + Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "prisoner-profile"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              + "--dpr.file.transfer.delete.copied.files" = "false"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Empty Temp Reload Bucket Data"                        = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "prisoner-profile"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Move Archived Data Back to Raw Bucket"                = {
                      + Next       = "Start Glue Batch Job"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "prisoner-profile"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              + "--dpr.file.transfer.delete.copied.files" = "true"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-raw-zone-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-raw-archive-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Prepare Temp Reload Bucket Data"                      = {
                      + Next       = "Copy Data to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "prisoner-profile"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Batch Job"                                 = {
                      + Next       = "Switch Hive Tables for Prisons to Curated"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "prisoner-profile"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-batch-prisoner-profile-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                             = {
                      + Next       = "Empty Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.clean.cdc.checkpoint" = "true"
                              + "--dpr.config.key"           = "prisoner-profile"
                              + "--dpr.config.s3.bucket"     = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-prisoner-profile-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                              = {
                      + Next       = "Prepare Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-prisoner-profile-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Curated"            = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "prisoner-profile"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      + Next       = "Truncate Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "prisoner-profile"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Truncate Data"                                        = {
                      + Next       = "Move Archived Data Back to Raw Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "prisoner-profile"
                              + "--dpr.file.deletion.buckets" = "dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-replay-pipeline-nomis-prisoner-profile-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "prisoner-profile"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "prisoner-profile"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.replay-pipeline["reference"].module.replay_pipeline.aws_iam_policy.step_function_execution[0] will be created
  + resource "aws_iam_policy" "step_function_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-replay-pipeline-nomis-reference-preproduction-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:UpdateLogDelivery",
                          + "logs:PutResourcePolicy",
                          + "logs:ListLogDeliveries",
                          + "logs:GetLogDelivery",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                          + "logs:DeleteLogDelivery",
                          + "logs:CreateLogDelivery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.replay-pipeline["reference"].module.replay_pipeline.aws_iam_role.step_function_role[0] will be created
  + resource "aws_iam_role" "step_function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-replay-pipeline-nomis-reference-preproduction-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.replay-pipeline["reference"].module.replay_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"
      + role       = (known after apply)
    }

  # module.replay-pipeline["reference"].module.replay_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.replay-pipeline["reference"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Replay Pipeline Step Function"
              + StartAt = "Stop Glue Streaming Job"
              + States  = {
                  + "Copy Data to Temp-Reload Bucket"                      = {
                      + Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "reference"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              + "--dpr.file.transfer.delete.copied.files" = "false"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Empty Temp Reload Bucket Data"                        = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "reference"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Move Archived Data Back to Raw Bucket"                = {
                      + Next       = "Start Glue Batch Job"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "reference"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              + "--dpr.file.transfer.delete.copied.files" = "true"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-raw-zone-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-raw-archive-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Prepare Temp Reload Bucket Data"                      = {
                      + Next       = "Copy Data to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "reference"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Batch Job"                                 = {
                      + Next       = "Switch Hive Tables for Prisons to Curated"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "reference"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-batch-reference-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                             = {
                      + Next       = "Empty Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.clean.cdc.checkpoint" = "true"
                              + "--dpr.config.key"           = "reference"
                              + "--dpr.config.s3.bucket"     = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-reference-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                              = {
                      + Next       = "Prepare Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-reference-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Curated"            = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "reference"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      + Next       = "Truncate Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "reference"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Truncate Data"                                        = {
                      + Next       = "Move Archived Data Back to Raw Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "reference"
                              + "--dpr.file.deletion.buckets" = "dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-replay-pipeline-nomis-reference-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "reference"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "reference"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.replay-pipeline["sentence"].module.replay_pipeline.aws_iam_policy.step_function_execution[0] will be created
  + resource "aws_iam_policy" "step_function_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-replay-pipeline-nomis-sentence-preproduction-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:UpdateLogDelivery",
                          + "logs:PutResourcePolicy",
                          + "logs:ListLogDeliveries",
                          + "logs:GetLogDelivery",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                          + "logs:DeleteLogDelivery",
                          + "logs:CreateLogDelivery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.replay-pipeline["sentence"].module.replay_pipeline.aws_iam_role.step_function_role[0] will be created
  + resource "aws_iam_role" "step_function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-replay-pipeline-nomis-sentence-preproduction-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.replay-pipeline["sentence"].module.replay_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"
      + role       = (known after apply)
    }

  # module.replay-pipeline["sentence"].module.replay_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.replay-pipeline["sentence"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Replay Pipeline Step Function"
              + StartAt = "Stop Glue Streaming Job"
              + States  = {
                  + "Copy Data to Temp-Reload Bucket"                      = {
                      + Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "sentence"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              + "--dpr.file.transfer.delete.copied.files" = "false"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Empty Temp Reload Bucket Data"                        = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "sentence"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Move Archived Data Back to Raw Bucket"                = {
                      + Next       = "Start Glue Batch Job"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "sentence"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              + "--dpr.file.transfer.delete.copied.files" = "true"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-raw-zone-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-raw-archive-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Prepare Temp Reload Bucket Data"                      = {
                      + Next       = "Copy Data to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "sentence"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Batch Job"                                 = {
                      + Next       = "Switch Hive Tables for Prisons to Curated"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "sentence"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-batch-sentence-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                             = {
                      + Next       = "Empty Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.clean.cdc.checkpoint" = "true"
                              + "--dpr.config.key"           = "sentence"
                              + "--dpr.config.s3.bucket"     = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-sentence-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                              = {
                      + Next       = "Prepare Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-sentence-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Curated"            = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "sentence"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      + Next       = "Truncate Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "sentence"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Truncate Data"                                        = {
                      + Next       = "Move Archived Data Back to Raw Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "sentence"
                              + "--dpr.file.deletion.buckets" = "dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-replay-pipeline-nomis-sentence-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "sentence"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "sentence"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.replay-pipeline["visits"].module.replay_pipeline.aws_iam_policy.step_function_execution[0] will be created
  + resource "aws_iam_policy" "step_function_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-replay-pipeline-nomis-visits-preproduction-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:UpdateLogDelivery",
                          + "logs:PutResourcePolicy",
                          + "logs:ListLogDeliveries",
                          + "logs:GetLogDelivery",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                          + "logs:DeleteLogDelivery",
                          + "logs:CreateLogDelivery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.replay-pipeline["visits"].module.replay_pipeline.aws_iam_role.step_function_role[0] will be created
  + resource "aws_iam_role" "step_function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-replay-pipeline-nomis-visits-preproduction-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.replay-pipeline["visits"].module.replay_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"
      + role       = (known after apply)
    }

  # module.replay-pipeline["visits"].module.replay_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.replay-pipeline["visits"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Replay Pipeline Step Function"
              + StartAt = "Stop Glue Streaming Job"
              + States  = {
                  + "Copy Data to Temp-Reload Bucket"                      = {
                      + Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "visits"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              + "--dpr.file.transfer.delete.copied.files" = "false"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Empty Temp Reload Bucket Data"                        = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "visits"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Move Archived Data Back to Raw Bucket"                = {
                      + Next       = "Start Glue Batch Job"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "visits"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              + "--dpr.file.transfer.delete.copied.files" = "true"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-raw-zone-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-raw-archive-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Prepare Temp Reload Bucket Data"                      = {
                      + Next       = "Copy Data to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "visits"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Batch Job"                                 = {
                      + Next       = "Switch Hive Tables for Prisons to Curated"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "visits"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-batch-visits-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                             = {
                      + Next       = "Empty Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.clean.cdc.checkpoint" = "true"
                              + "--dpr.config.key"           = "visits"
                              + "--dpr.config.s3.bucket"     = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-visits-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                              = {
                      + Next       = "Prepare Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-visits-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Curated"            = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "visits"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      + Next       = "Truncate Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "visits"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Truncate Data"                                        = {
                      + Next       = "Move Archived Data Back to Raw Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "visits"
                              + "--dpr.file.deletion.buckets" = "dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-replay-pipeline-nomis-visits-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

Plan: 65 to add, 13 to change, 0 to destroy.

```